# Pandas

In [1]:
import pandas as pd
import numpy as np

In [2]:
df = pd.DataFrame()

In [3]:
print(df)

Empty DataFrame
Columns: []
Index: []

In [4]:
df1 = pd.DataFrame([[1,2,3,4,],[5,6,7,8],[9,10,11,12],[13,14,15,16]], columns=['A','B','C','D'])

In [5]:
df1.head(2)

   A  B  C  D
0  1  2  3  4
1  5  6  7  8

In [6]:
df1.tail(2)

    A   B   C   D
2   9  10  11  12
3  13  14  15  16

In [7]:
df1

    A   B   C   D
0   1   2   3   4
1   5   6   7   8
2   9  10  11  12
3  13  14  15  16

In [8]:
df1.shape

(4, 4)

In [9]:
df1.iloc[0:2,1:3]

   B  C
0  2  3
1  6  7

#  Read csv file

In [10]:
df = pd.read_csv('iris_data.csv')

In [11]:
df.head()

   sepal_length  sepal_width  petal_length  petal_width species
0           5.1          3.5           1.4          0.2  setosa
1           4.9          3.0           1.4          0.2  setosa
2           4.7          3.2           1.3          0.2  setosa
3           4.6          3.1           1.5          0.2  setosa
4           5.0          3.6           1.4          0.2  setosa

In [12]:
print(df['species'].astype('category'))

0         setosa
1         setosa
2         setosa
3         setosa
4         setosa
         ...
145    virginica
146    virginica
147    virginica
148    virginica
149    virginica
Name: species, Length: 150, dtype: category
Categories (3, object): ['setosa', 'versicolor', 'virginica']

# Export csv

In [13]:
df2 = pd.DataFrame([[1,2,3,4,],[5,6,7,8],[9,10,11,12],[13,14,15,16]], columns=['A','B','C','D'])

In [14]:
df2.head()

    A   B   C   D
0   1   2   3   4
1   5   6   7   8
2   9  10  11  12
3  13  14  15  16

In [15]:
df2.to_csv('export.csv', index = False)

# Data Frame merging

In [27]:
df3 = pd.DataFrame([[1,2,12],[4,7,76],[8,9,4]], columns=['A','B','C'])

In [28]:
df3

   A  B   C
0  1  2  12
1  4  7  76
2  8  9   4

In [31]:
df4 = pd.DataFrame([[21,7,62],[34,2,96],[18,19,24]], columns=['X','Y','Z'])

In [32]:
df4

    X   Y   Z
0  21   7  62
1  34   2  96
2  18  19  24

In [33]:
df5 = pd.merge(df3, df4, right_on='Y', left_on='B')

In [34]:
df5

   A  B   C   X  Y   Z
0  1  2  12  34  2  96
1  4  7  76  21  7  62